tutorials/mesh/foamyHexMesh/mixerVessel/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          meshQualityControls;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxNonOrtho         60;
maxBoundarySkewness 50;
maxInternalSkewness 10;
maxConcave          80;
minVol              1e-20;
minTetQuality       1e-30;
minArea             -1;
minTwist            0.0;
minDeterminant      0.001;
minFaceWeight       0.02;
minVolRatio         0.01;
minTriangleTwist    -1;

// ************************************************************************* //
